Revit 2027 API
FluidType.RemoveTemperature Method
 Removes a fluid temperature via the temperature value from the set.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveTemperature(
	double temperature
)
Public Sub RemoveTemperature (
	temperature As Double
)
public:
void RemoveTemperature(
	double temperature
)
member RemoveTemperature :
        temperature : float -> unit
Parameters
temperature Double
 The temperature value.
Exceptions
Exception | Condition
ArgumentException |  Thrown if the temperature that will be removed doesn't exist in the fluid type or the temperature that will be removed is in use.
See Also
Reference
FluidType Class
Autodesk.Revit.DB.Plumbing Namespace